app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "checking"], ["user_id", 1], ["created_at", "2017-09-05 06:54:20.979905"], ["updated_at", "2017-09-05 06:54:20.979905"]]
---
    def create
        @micropost = current_user.microposts.build(microppst_params)
        if @micropost.save

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "microposts" SET "content" = ?, "updated_at" = ? WHERE "microposts"."id" = ?  [["content", "changing my post"], ["updated_at", "2017-09-07 06:16:26.928875"], ["id", 4]]
---
    def update
        @micropost = Micropost.find(params[:id])
        if @micropost.update_attributes(microppst_params)